tutorials/XiFoam/moriyoshiHomogeneous/0/Tu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    left            
    {
        type            symmetryPlane;
    }

    right           
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
